#include <iostream>

using namespace std;

    class Fraction
{
   int num, denum;

   void norm()
   {
      for (int k = 2; k <= num && k <= denum ; ++k) {
         while (num % k == 0 && denum % k == 0) {
            num /= k;
            denum /= k;
         }
      }
   }

public:
   Fraction (int ch=0, int zn=1) : num(ch), denum(zn) { }

   Fraction operator+(Fraction b)
   {
      int ch = num*b.denum + denum*b.num;
      int zn = denum*b.denum;
      return Fraction(ch, zn);
   }

   Fraction operator-(Fraction b)
   {
      int ch = num*b.denum - denum*b.num;
      int zn = denum*b.denum;
      return Fraction(ch, zn);
   }

   Fraction operator*(Fraction b)
   {
      int ch = num*b.num;
      int zn = denum*b.denum;
      return Fraction(ch, zn);
   }

   Fraction operator/(Fraction b)
   {
      int ch = num*b.denum;
      int zn = denum*b.num;
      return Fraction(ch, zn);
   }

   friend ostream & operator<<(ostream & s, Fraction b)
   {
      b.norm();
      s << b.num << "/" << b.denum;
      return s;
   }
};

     int v_exit()
     {
       cout<<"********************************************************************************"<<endl;
     cout<<"\n   Вы хотите продолжить?"<<endl;
     cout<<"   Нажмите 0 для продолжения."<<endl;
     cout<<"   Нажмите 1 если хотите выйти."<<endl;
     cout<<"   Ввод: ";
     } /* void_exit */

int main()
{
    setlocale(LC_ALL, "");

////////////////////////////////////////
 /* Площадь */
    float X; /* Длина  */
    float Y; /* Ширина */
///////////////////////////////////////
 /* Число ПИ */
     float p = 3.14; /* Число ПИ */
     float ip; /* Число пользователя */
///////////////////////////////////////
 /* Калькулятор */
    int kul;
    float one; /* ПЕРВОЕ ЧИСЛО */
    float two; /* ВТОРОЕ ЧИСЛО */
///////////////////////////////////////
 /* Степень */
    float a;
    int b;
    float pt = 1;
///////////////////////////////////////
 /* ДРОБИ */
   int a1, b1;
   int a2, b2;
   char znakd;
    bool exitd = false;
///////////////////////////////////////
 /* Детали программы */
     int znak; /* ЗНАК */
     int znakp; /* ЗНАК (ПЕРИМЕТР) */
     bool exit = false; /* ВЫХОД */
//////////////////////////////////////

    while (!exit)
    {
     cout<<"                            ...Кaлькулятор..."<<endl;
      cout<<"   1-Обычный кaлькулятор."<<endl
          <<"   2-Число ПИ."<<endl
          <<"   3-Периметр."<<endl
          <<"   4-Площадь."<<endl
          <<"   5-Степень."<<endl
          <<"   6-Рациональные дроби."<<endl;
     cout<<"   Введите число: ";
      cin>>kul;
    switch (kul)
    {
//////////////////////////////////////////////////////////////////////////////////////////
case 0: /* ВЫХОД */
    cout<<"\n   Программа завершена!";
     return 0;
      break;
/////////////////////////////////////////////////////////////////////////////////////////
case 1: /* ОБЫЧНЫЙ КАЛЬКУЛЯТОР */
    cout<<"\n   Введите первое число: ";
     cin>>one;
    cout<<"   Введите второе число: ";
     cin>>two;
    cout<<"   1-(+),"<<endl /* сложение */
        <<"   2-(-),"<<endl /* разность */
        <<"   3-(*),"<<endl /* умножение */
        <<"   4-(/),"<<endl /* деление */
        <<"   Введите число знака: ";
     cin>>znak;
    switch (znak)
    {
     case 1: /* сложение */
      cout<<"\n   Вывод: "<< one <<" + "<< two << " = " << one + two << endl;
       v_exit();
        cin>>exit;
          cout<<"********************************************************************************"<<endl;
         break;
//################################
     case 2: /* разность */
      cout<<"\n   Вывод: "<< one <<" - "<< two << " = " << one - two << endl;
        v_exit();
         cin>>exit;
           cout<<"********************************************************************************"<<endl;
          break;
//################################
     case 3: /* умножение */
      cout<<"\n   Вывод: "<< one << " * "<< two << " = " << one * two << endl;
        v_exit();
         cin>>exit;
           cout<<"********************************************************************************"<<endl;
          break;
//################################
     case 4: /* деление */
      cout<<"\n   Вывод: "<< one <<" / "<< two << " = " << one / two << endl;
        v_exit();
         cin>>exit;
           cout<<"********************************************************************************"<<endl;
          break;
//################################
     default:
       cout<<"\n   Такого знака нет!!!"<<endl;
        v_exit();
         cin>>exit;
           cout<<"********************************************************************************"<<endl;
          break;
     break;
//################################
    } /* switch_znak */
     break;
////////////////////////////////////////////////////////////////////////////////////////
case 2: /* ЧИСЛО ПИ */
     cout<<"\n    Введите свое число: ";
      cin>>ip;
    cout<<"    Что вы хотите сделать с числом ПИ и со свим числом: "<<endl;
      cout<<"   1-(+),"<<endl /* сложение */
          <<"   2-(-),"<<endl /* разность */
          <<"   3-(*),"<<endl /* умножение */
          <<"   4-(/),"<<endl /* деление */
          <<"   Введите число знака: ";
      cin>>znakp;
    switch (znakp)
    {
     case 1: /* сложение */
      cout<<"\n   Вывод: "<< ip <<" + "<< p << " = " << ip + p << endl;
       v_exit();
        cin>>exit;
          cout<<"********************************************************************************"<<endl;
         break;
//#################################
     case 2: /* разность */
      cout<<"\n   Вывод: "<< ip <<" - "<< p << " = " << ip - p << endl;
       v_exit();
        cin>>exit;
          cout<<"********************************************************************************"<<endl;
         break;
//#################################
     case 3: /* умножение */
      cout<<"\n   Вывод: "<< ip << " * "<< p << " = " << ip * p << endl;
       v_exit();
        cin>>exit;
          cout<<"********************************************************************************"<<endl;
         break;
//#################################
     case 4: /* деление */
      cout<<"\n   Вывод: "<< one <<" / "<< p << " = " << ip / p << endl;
       v_exit();
        cin>>exit;
          cout<<"********************************************************************************"<<endl;
         break;
//#################################
     default:
       cout<<"\n   ERROR 404!";
        v_exit();
         cin>>exit;
           cout<<"********************************************************************************"<<endl;
          break;
//#################################
    } /* switch_pi */
     break;
//////////////////////////////////////////////////////////////////////////////////////
case 3: /* ПЕРИМЕТР */
    cout<<"\n    Введите длину: ";
     cin>>X; // ДЛИНА
    cout<<"    Введите ширину: ";
     cin>>Y; // ШИРИНА
    cout<<"\n  Периметр: "<<X<<" и "<<Y<<" = "<< X + Y + X + Y <<endl;
     v_exit();
      cin>>exit;
        cout<<"********************************************************************************"<<endl;
       break;
//////////////////////////////////////////////////////////////////////////////////////
case 4: /* ПЛОЩАДЬ */
    cout<<"\n    Введите длину: ";
     cin>>X; // ДЛИНА
    cout<<"    Введите ширину: ";
     cin>>Y; // ШИРИНА
    cout<<"\n  Площадь: "<<X<<" и "<<Y<<" = "<< X * Y <<endl;
     v_exit();
      cin>>exit;
        cout<<"********************************************************************************"<<endl;
       break;
//////////////////////////////////////////////////////////////////////////////////////
case 5: /* СТЕПЕНЬ */
    cout<<"\n   Введите число: ";
     cin>>a;
    if (a == 0 || a == -0 || a < 0)
    {
     cout<<"\n   ERROR!";
      return 0;
    } /* ERROR_A */
    else {
    cout<<"   Введите степень числа: ";
     cin>>b;
    }
    if (b == 0 || b == -0 || b < 0)
    {
     cout<<"\n   ERROR!"<<endl;
      return 0;
    } /* ERROR_B */
    for (int i = 1; i <= b; i++)
    {
     pt*=a;
    }
    cout<<"\n   "<<a<<" В степени "<<b<<" = "<< pt <<endl;
     v_exit();
      cin>>exit;
        cout<<"********************************************************************************"<<endl;
       break;
//////////////////////////////////////////////////////////////////////////////////////
case 6:

   while (!exitd)
   {
     cout<<"\n  Введите числитель: ";
      cin>>a1;
     cout<<"  Введите знаменатель: ";
      cin>>b1;
     cout<<"  Введите числитель: ";
      cin>>a2;
     cout<<"  Введите знаменатель: ";
      cin>>b2;
    cout<<"   Какая операция будет проводиться "<<endl
        <<"   1-(+), 2-(-), 3-(*), 4-(/)."<<endl;
     cout<<"  Ввод: ";
      cin>>znakd;
   Fraction a(a1, b1), b(a2, b2);

   switch (znakd)
   {
    case '1': {
   case '+':
     cout << "   a = " << a << endl;
     cout << "   b = " << b << endl;
      cout << "   " << a << " + " << b << " = " << a + b << endl;
    cout<<"\n  Для продолжения нажмите 0."<<endl
        <<"  Для выхода нажмите 1."<<endl;
     cout<<"  Ввод: ";
      cin>>exitd;
       }break;

    case '2': {
   case '-':
     cout << "  a = " << a << endl;
     cout << "  b = " << b << endl;
      cout << "  " << a << " - " << b << " = " << a - b << endl;
    cout<<"\n  Для продолжения нажмите 0."<<endl
        <<"  Для выхода нажмите 1."<<endl;
     cout<<"  Ввод: ";
      cin>>exitd;
       }break;

    case '3': {
   case '*':
     cout << "  a = " << a << endl;
     cout << "  b = " << b << endl;
      cout << "  " << a << " * " << b << " = " << a * b << endl;
    cout<<"\n  Для продолжения нажмите 0."<<endl
        <<"  Для выхода нажмите 1."<<endl;
     cout<<"  Ввод: ";
      cin>>exitd;
      }break;

    case '4': {
   case '/':
     cout << "  a = " << a << endl;
     cout << "  b = " << b << endl;
      cout << "  " << a << " / " << b << " = " << a / b << endl;
    cout<<"\n  Для продолжения нажмите 0."<<endl
        <<"  Для выхода нажмите 1."<<endl;
     cout<<"  Ввод: ";
      cin>>exitd;
       }break;
   } // SWITCH //
   } // WHILE //
   break;
//////////////////////////////////////////////////////////////////////////////////////
default: { /* ОШИБКА */
    cout<<"\n   ERROR 404!"<<endl;
     v_exit();
      cin>>exit;
        cout<<"********************************************************************************"<<endl;
}
       break;
/////////////////////////////////////////////////////////////////////////////////////
    } /* switch_1 */
    } /* WHILE */
    return 0;
}
